# Taps
#tap 'homebrew/cask'
#tap 'homebrew/cask-eid'
#tap 'homebrew/cask-fonts'
#tap 'homebrew/cask-versions'
#tap 'homebrew/bundle'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'
brew 'moreutils'
brew 'findutils' 
brew 'gnu-sed --with-default-names'

# Install a modern version of Bash.
#brew 'bash'
#brew 'bash-completion2'

# Install wget with IRI support
brew 'wget --with-iri'

# Install more recent versions of some OS X tools
brew 'vim --with-override-system-vi'
brew 'nano'
brew 'grep'
brew 'openssh'
brew 'screen'
brew 'gmp'

# Install other useful binaries
brew 'the_silver_searcher'
brew 'fzf'
brew 'git'
brew 'git-lfs'
brew 'gnupg'
brew 'hub'
brew 'ghostscript' # Also known as 'sg'
brew 'pipeviewer' # Also known as 'pv'
brew 'rename'
brew 'tree' # List directories in a tree structure
brew 'zopfli'
brew 'zlib' # Needed for Memcached
brew 'p7zip'
brew 'pigz'
brew 'vbindiff'
brew 'httpie'
brew 'bat' # "cat" on steroids
brew 'terminal-notifier'
brew 'android-platform-tools'
brew 'pidcat' # colored logcat guy
brew 'ncdu' # Find where your diskspace went

# Install multimedia tools
brew 'ffmpeg --with-libvpx'
brew 'imagemagick --with-webp'

#Install Mac App Store command-line interface
brew 'mas' 

# Install some CTF tools;
brew 'aircrack-ng'
brew 'bfg'
brew 'binutils'
brew 'binwalk'
brew 'cifer'
brew 'dex2jar'
brew 'dns2tcp'
brew 'fcrackzip'
brew 'foremost'
brew 'hashpump'
brew 'hydra'
brew 'john'
brew 'knock'
brew 'netpbm'
brew 'nmap'
brew 'pngcheck'
brew 'socat'
brew 'sqlmap'
brew 'tcpflow'
brew 'tcpreplay'
brew 'tcptrace'
brew 'ucspi-tcp' # `tcpserver` etc.
brew 'xpdf'
brew 'xz'

# Install some Forensic tools
brew 'autopsy'
brew 'dc3dd'
brew 'volatility'

# Install some Development tools
#brew 'php'
#brew 'php@7.3'
#brew 'php@7.2'
#brew 'composer'
#brew 'imagemagick'
#brew 'mysql'
#brew 'nginx'
#brew 'node'
#brew 'redis'
#brew 'yarn'

# Apps
cask 'aerial'
cask 'adobe-creative-cloud'
cask 'adobe-acrobat-reader'
cask 'betterzip'
cask 'db-browser-for-sqlite'
cask 'dropbox'
cask 'discord'
cask 'disk-inventory-x'
cask 'docker'
cask 'easyfind'
cask 'filezilla'
cask 'fsmonitor'
cask 'ghidra'
cask 'github'
cask 'google-backup-and-sync'
cask 'gpg-suite'
cask 'hopper-disassembler'
cask 'insomnia'
cask 'java'
cask 'mysqlworkbench'
cask 'maltego'
cask 'microsoft-office'
cask 'skype'
cask 'slack'
cask 'transmission'
cask 'textwrangler'
cask 'vagrant'
cask 'viscosity'
cask 'vmware-fusion'
cask 'wireshark'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'yed'

# Browsers
cask 'google-chrome'
# cask 'google-chrome-canary'
cask 'firefox'
# cask 'firefoxnightly'
# cask 'webkit-nightly'
# cask 'chromium'
#cask 'tor-browser'

# Quicklook
cask 'qlcolorcode'
#cask 'qlmarkdown'
cask 'quicklook-json'
#cask 'quicklook-csv'
cask 'qlstephen'
cask 'qlvideo'
cask 'suspicious-package'

#zsh
zsh-autosuggestions
zsh-completions
zsh-syntax-highlighting

# Fonts
cask 'font-hack-nerd-font'

# Mac App Store
mas 'Flycut', id: 442160987 Flycut
mas 'YubiKey Personalization Tool', id: 638161122
mas 'HashMaker', id: 509733654
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Amphetamine', id: 937984704
mas 'TextWrangler', id: 408981434

